Sumed-Sreedhar/Event-Driven-PWM-LED-Controller-STM32F446RE-/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MODE_STATUS_BUTTON_Pin GPIO_PIN_13
#define MODE_STATUS_BUTTON_GPIO_Port GPIOC
#define MODE_STATUS_BUTTON_EXTI_IRQn EXTI15_10_IRQn
#define COLUMN_1_keypad_Pin GPIO_PIN_0
#define COLUMN_1_keypad_GPIO_Port GPIOA
#define COLUMN_2_keypad_Pin GPIO_PIN_1
#define COLUMN_2_keypad_GPIO_Port GPIOA
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define COLUMN_3_keypad_Pin GPIO_PIN_4
#define COLUMN_3_keypad_GPIO_Port GPIOA
#define STATUS_LED_Pin GPIO_PIN_5
#define STATUS_LED_GPIO_Port GPIOA
#define CLEAR_FAULT_BUTTON_Pin GPIO_PIN_7
#define CLEAR_FAULT_BUTTON_GPIO_Port GPIOA
#define CLEAR_FAULT_BUTTON_EXTI_IRQn EXTI9_5_IRQn
#define ROW_2_keypad_Pin GPIO_PIN_10
#define ROW_2_keypad_GPIO_Port GPIOB
#define FAULT_LED_Pin GPIO_PIN_7
#define FAULT_LED_GPIO_Port GPIOC
#define ROW_1_keypad_Pin GPIO_PIN_8
#define ROW_1_keypad_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define ROW_3_keypad_Pin GPIO_PIN_4
#define ROW_3_keypad_GPIO_Port GPIOB
#define ROW_4_keypad_Pin GPIO_PIN_5
#define ROW_4_keypad_GPIO_Port GPIOB
#define FORCE_FAULT_BUTTON_Pin GPIO_PIN_6
#define FORCE_FAULT_BUTTON_GPIO_Port GPIOB
#define FORCE_FAULT_BUTTON_EXTI_IRQn EXTI9_5_IRQn

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
